---
title: FTP的基本命令使用
tags: ftp,命令
grammar_cjkRuby: true
---

* content
{:toc}

## 连接

在命令行终端可以使用如下命令连接ftp服务器：

```
C:>ftp 192.168.58.128
连接到 192.168.58.128。
220 (vsFTPd 3.0.2)
用户(192.168.58.128:(none)): kael
331 Please specify the password.
密码:
230 Login successful.
```

也可以使用如下方式连接：

```
C:> ftp
ftp> open 192.168.58.128
连接到 192.168.58.128。
220 (vsFTPd 3.0.2)
用户(192.168.58.128:(none)): kael
331 Please specify the password.
密码:
230 Login successful.
```

想断开连接可以使用如下命令：

```
ftp> close
221 Goodbye.
```

如果想退出ftp命令行，可以使用：

```
ftp> bye
C:> 
```

## 目录跳转

本地目录跳转：

```
ftp> lcd C:\Users
目前的本地目录 C:\Users。
```

服务端目录跳转根据实际的服务端操作系统决定，如：

```
ftp> cd ..
```

执行本地命令，在命令前加`!`即可：

```
ftp> !dir
 驱动器 C 中的卷是 系统
 卷的序列号是 0001-22B9

 C:\Users 的目录

2017/03/13  11:48    <DIR>          .
2017/03/13  11:48    <DIR>          ..
2017/03/09  10:42    <DIR>          Administrator
2017/03/10  17:31    <DIR>          idcadmin
2017/03/13  14:27    <DIR>          Public
               0 个文件              0 字节
               6 个目录 63,309,078,528 可用字节
```

## 上传下载

上传命令：

```
ftp> put file.txt
```

下载命令：

```
ftp> get file.txt
```

删除服务器文件：

```
ftp> delete file.txt
```